soerengraae/MoTG49/G49_MoT_Project/Project/Inc/stm32g491xx_defines.h
//stm32g491xx_#defines.h wmh 2024-09-28 : adds STM32G491xx-specific interrupt numbers
//stm32g491xx_#defines.h wmh 2024-09-21 : #defines extracted from stm32g491xx.h (omits structs)
// usage: include this with a header file which #defines register offsets of some peripheral of the STM32G491
//	      then use it with macros defined in 'bit-op_macros.S' to configure and operate the peripheral.

#ifndef _STM32G491XX_DEFINES_
#define _STM32G491XX_DEFINES_

/**
  * @}
  */

/* core-cm4 standard components */
#define NVIC_BASE 0xE000E100
#define NVIC_ISER (NVIC_BASE + 0x000) /* (R/W)  Interrupt Set Enable Register */
#define NVIC_ICER (NVIC_BASE + 0x080) /* (R/W)  Interrupt Clear Enable Register */
#define NVIC_ISPR (NVIC_BASE + 0x100) /* (R/W)  Interrupt Set Pending Register */
#define NVIC_ICPR (NVIC_BASE + 0x180) /* (R/W)  Interrupt Clear Pending Register */
#define NVIC_IABR (NVIC_BASE + 0x200) /* (R/W)  Interrupt Active bit Register */
#define NVIC_IPR  (NVIC_BASE + 0x300) /* (R/W)  Interrupt Priority Register (byte) */
#define NVIC_STIR (NVIC_BASE + 0xE00) /* (Wonly)Software Trigger Interrupt Register */

/*************  Cortex-M4 Processor Exceptions Numbers *********************************************************************************/
#define   NonMaskableInt_IRQn          -14     /*!< 2 Cortex-M4 Non Maskable Interrupt                                                 */
#define   HardFault_IRQn               -13     /*!< 3 Cortex-M4 Hard Fault Interrupt                                                   */
#define   MemoryManagement_IRQn        -12     /*!< 4 Cortex-M4 Memory Management Interrupt                                            */
#define   BusFault_IRQn                -11     /*!< 5 Cortex-M4 Bus Fault Interrupt                                                    */
#define   UsageFault_IRQn              -10     /*!< 6 Cortex-M4 Usage Fault Interrupt                                                  */
#define   SVCall_IRQn                  -5      /*!< 11 Cortex-M4 SV Call Interrupt                                                     */
#define   DebugMonitor_IRQn            -4      /*!< 12 Cortex-M4 Debug Monitor Interrupt                                               */
#define   PendSV_IRQn                  -2      /*!< 14 Cortex-M4 Pend SV Interrupt                                                     */
#define   SysTick_IRQn                 -1      /*!< 15 Cortex-M4 System Tick Interrupt                                                 */
/******  STM32G491xx-specific Interrupt Numbers ****************************************************************************************/
#define   WWDG_IRQn                    0       /*!< Window WatchDog Interrupt                                                          */
#define   PVD_PVM_IRQn                 1       /*!< PVD/PVM1/PVM2/PVM3/PVM4 through EXTI Line detection Interrupts                     */
#define   RTC_TAMP_LSECSS_IRQn         2       /*!< RTC Tamper and TimeStamp and RCC LSE CSS interrupts through the EXTI               */
#define   RTC_WKUP_IRQn                3       /*!< RTC Wakeup interrupt through the EXTI line                                         */
#define   FLASH_IRQn                   4       /*!< FLASH global Interrupt                                                             */
#define   RCC_IRQn                     5       /*!< RCC global Interrupt                                                               */
#define   EXTI0_IRQn                   6       /*!< EXTI Line0 Interrupt                                                               */
#define   EXTI1_IRQn                   7       /*!< EXTI Line1 Interrupt                                                               */
#define   EXTI2_IRQn                   8       /*!< EXTI Line2 Interrupt                                                               */
#define   EXTI3_IRQn                   9       /*!< EXTI Line3 Interrupt                                                               */
#define   EXTI4_IRQn                   10      /*!< EXTI Line4 Interrupt                                                               */
#define   DMA1_Channel1_IRQn           11      /*!< DMA1 Channel 1 global Interrupt                                                    */
#define   DMA1_Channel2_IRQn           12      /*!< DMA1 Channel 2 global Interrupt                                                    */
#define   DMA1_Channel3_IRQn           13      /*!< DMA1 Channel 3 global Interrupt                                                    */
#define   DMA1_Channel4_IRQn           14      /*!< DMA1 Channel 4 global Interrupt                                                    */
#define   DMA1_Channel5_IRQn           15      /*!< DMA1 Channel 5 global Interrupt                                                    */
#define   DMA1_Channel6_IRQn           16      /*!< DMA1 Channel 6 global Interrupt                                                    */
#define   DMA1_Channel7_IRQn           17      /*!< DMA1 Channel 7 global Interrupt                                                    */
#define   ADC1_2_IRQn                  18      /*!< ADC1 and ADC2 global Interrupt                                                     */
#define   USB_HP_IRQn                  19      /*!< USB HP Interrupt                                                                   */
#define   USB_LP_IRQn                  20      /*!< USB LP  Interrupt                                                                  */
#define   FDCAN1_IT0_IRQn              21      /*!< FDCAN1 IT0 Interrupt                                                               */
#define   FDCAN1_IT1_IRQn              22      /*!< FDCAN1 IT1 Interrupt                                                               */
#define   EXTI9_5_IRQn                 23      /*!< External Line[9:5] Interrupts                                                      */
#define   TIM1_BRK_TIM15_IRQn          24      /*!< TIM1 Break  Transition error  Index error and TIM15 global interrupt               */
#define   TIM1_UP_TIM16_IRQn           25      /*!< TIM1 Update Interrupt and TIM16 global interrupt                                   */
#define   TIM1_TRG_COM_TIM17_IRQn      26      /*!< TIM1 TIM1 Trigger  Commutation  Direction change  Index and TIM17 global interrupt */
#define   TIM1_CC_IRQn                 27      /*!< TIM1 Capture Compare Interrupt                                                     */
#define   TIM2_IRQn                    28      /*!< TIM2 global Interrupt                                                              */
#define   TIM3_IRQn                    29      /*!< TIM3 global Interrupt                                                              */
#define   TIM4_IRQn                    30      /*!< TIM4 global Interrupt                                                              */
#define   I2C1_EV_IRQn                 31      /*!< I2C1 Event Interrupt                                                               */
#define   I2C1_ER_IRQn                 32      /*!< I2C1 Error Interrupt                                                               */
#define   I2C2_EV_IRQn                 33      /*!< I2C2 Event Interrupt                                                               */
#define   I2C2_ER_IRQn                 34      /*!< I2C2 Error Interrupt                                                               */
#define   SPI1_IRQn                    35      /*!< SPI1 global Interrupt                                                              */
#define   SPI2_IRQn                    36      /*!< SPI2 global Interrupt                                                              */
#define   USART1_IRQn                  37      /*!< USART1 global Interrupt                                                            */
#define   USART2_IRQn                  38      /*!< USART2 global Interrupt                                                            */
#define   USART3_IRQn                  39      /*!< USART3 global Interrupt                                                            */
#define   EXTI15_10_IRQn               40      /*!< External Line[15:10] Interrupts                                                    */
#define   RTC_Alarm_IRQn               41      /*!< RTC Alarm (A and B) through EXTI Line Interrupt                                    */
#define   USBWakeUp_IRQn               42      /*!< USB Wakeup through EXTI line Interrupt                                             */
#define   TIM8_BRK_IRQn                43      /*!< TIM8 Break  Transition error and Index error Interrupt                             */
#define   TIM8_UP_IRQn                 44      /*!< TIM8 Update Interrupt                                                              */
#define   TIM8_TRG_COM_IRQn            45      /*!< TIM8 Trigger  Commutation  Direction change and Index Interrupt                    */
#define   TIM8_CC_IRQn                 46      /*!< TIM8 Capture Compare Interrupt                                                     */
#define   ADC3_IRQn                    47      /*!< ADC3 global  Interrupt                                                             */
#define   LPTIM1_IRQn                  49      /*!< LP TIM1 Interrupt                                                                  */
#define   SPI3_IRQn                    51      /*!< SPI3 global Interrupt                                                              */
#define   UART4_IRQn                   52      /*!< UART4 global Interrupt                                                             */
#define   UART5_IRQn                   53      /*!< UART5 global Interrupt                                                             */
#define   TIM6_DAC_IRQn                54      /*!< TIM6 global and DAC1&3 underrun error  interrupts                                  */
#define   TIM7_IRQn                    55      /*!< TIM7 global interrupts                                                             */
#define   DMA2_Channel1_IRQn           56      /*!< DMA2 Channel 1 global Interrupt                                                    */
#define   DMA2_Channel2_IRQn           57      /*!< DMA2 Channel 2 global Interrupt                                                    */
#define   DMA2_Channel3_IRQn           58      /*!< DMA2 Channel 3 global Interrupt                                                    */
#define   DMA2_Channel4_IRQn           59      /*!< DMA2 Channel 4 global Interrupt                                                    */
#define   DMA2_Channel5_IRQn           60      /*!< DMA2 Channel 5 global Interrupt                                                    */
#define   UCPD1_IRQn                   63      /*!< UCPD global Interrupt                                                              */
#define   COMP1_2_3_IRQn               64      /*!< COMP1  COMP2 and COMP3 Interrupts                                                  */
#define   COMP4_IRQn                   65      /*!< COMP4                                                                              */
#define   CRS_IRQn                     75      /*!< CRS global interrupt                                                               */
#define   SAI1_IRQn                    76      /*!< Serial Audio Interface global interrupt                                            */
#define   TIM20_BRK_IRQn               77      /*!< TIM20 Break  Transition error and Index error Interrupt                            */
#define   TIM20_UP_IRQn                78      /*!< TIM20 Update interrupt                                                             */
#define   TIM20_TRG_COM_IRQn           79      /*!< TIM20 Trigger  Commutation  Direction change and Index Interrupt                   */
#define   TIM20_CC_IRQn                80      /*!< TIM20 Capture Compare interrupt                                                    */
#define   FPU_IRQn                     81      /*!< FPU global interrupt                                                               */
#define   FDCAN2_IT0_IRQn              86      /*!< FDCAN2 interrupt line 0 interrupt                                                  */
#define   FDCAN2_IT1_IRQn              87      /*!< FDCAN2 interrupt line 1 interrupt                                                  */
#define   RNG_IRQn                     90      /*!< RNG global interrupt                                                               */
#define   LPUART1_IRQn                 91      /*!< LP UART 1 Interrupt                                                                */
#define   I2C3_EV_IRQn                 92      /*!< I2C3 Event Interrupt                                                               */
#define   I2C3_ER_IRQn                 93      /*!< I2C3 Error interrupt                                                               */
#define   DMAMUX_OVR_IRQn              94      /*!< DMAMUX overrun global interrupt                                                    */
#define   QUADSPI_IRQn                 95      /*!< QUADSPI interrupt                                                                  */
#define   DMA1_Channel8_IRQn           96      /*!< DMA1 Channel 8 interrupt                                                           */
#define   DMA2_Channel6_IRQn           97      /*!< DMA2 Channel 6 interrupt                                                           */
#define   DMA2_Channel7_IRQn           98      /*!< DMA2 Channel 7 interrupt                                                           */
#define   DMA2_Channel8_IRQn           99      /*!< DMA2 Channel 8 interrupt                                                           */
#define   CORDIC_IRQn                  100     /*!< CORDIC global Interrupt                                                            */
#define   FMAC_IRQn                    101     /*!< FMAC global Interrupt                                                              */


/** @STM32G491xx-specific Peripheral_memory_map
  * @{
  */

#define FLASH_BASE            (0x08000000) /*!< FLASH (up to 512 kB) base address */
#define SRAM1_BASE            (0x20000000) /*!< SRAM1(up to 80 KB) base address */
#define SRAM2_BASE            (0x20014000) /*!< SRAM2(16 KB) base address */
#define CCMSRAM_BASE          (0x10000000) /*!< CCMSRAM(16 KB) base address */
#define PERIPH_BASE           (0x40000000) /*!< Peripheral base address */
#define QSPI_BASE             (0x90000000) /*!< QUADSPI memories accessible over AHB base address */

#define QSPI_R_BASE           (0xA0001000) /*!< QUADSPI control registers base address */
#define SRAM1_BB_BASE         (0x22000000) /*!< SRAM1(80 KB) base address in the bit-band region */
#define SRAM2_BB_BASE         (0x22280000) /*!< SRAM2(16 KB) base address in the bit-band region */
#define CCMSRAM_BB_BASE       (0x22300000) /*!< CCMSRAM(16 KB) base address in the bit-band region */
#define PERIPH_BB_BASE        (0x42000000) /*!< Peripheral base address in the bit-band region */
/* Legacy defines */
#define SRAM_BASE             SRAM1_BASE
#define SRAM_BB_BASE          SRAM1_BB_BASE

